app/controllers/products_controller.rb

  def index
    #@products = Product.all
    #@products = Product.where(user_id: current_user.id)
    if current_user.kind =='Gerente'
      @products = Product.all
---
SELECT "products".* FROM "products"