app/controllers/products_controller.rb

SELECT COUNT(*) FROM "products"
SELECT  "products".* FROM "products" WHERE "products"."user_id" = ? ORDER BY "products"."id" ASC LIMIT ? OFFSET ?  [["user_id", 3], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products" WHERE "products"."user_id" = ?  [["user_id", 3]]
---
  def index
    if current_user.kind == 'Gerente'
      #@products = Product.paginate(:page=>params[:page],per_page:10)
      @products = Product.order(:id).page(params[:page]).per(10)
    else
      @products = Product.where(user_id: current_user.id).order(:id).page(params[:page]).per(10)

INSERT INTO "products" ("code", "unit_of_measurement", "quantity", "description", "damage", "balance_id", "product_kind_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "quantity" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["quantity", 2], ["updated_at", "2019-03-30 22:41:35.951154"], ["id", 25]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)