app/views/products/_form.html.erb

    <div class="col-lg-10">
      <%= collection_select(:product, :balance_id, Balance.all, :id, :name, {:include_blank => true}, {:class => 'form-control'}) %>
---
SELECT "products".* FROM "products"
SELECT "balances".* FROM "balances"

    <div class="col-lg-10">
      <%= collection_select(:product, :product_kind_id, ProductKind.all, :id, :name, {:include_blank => true}, {:class => 'form-control'}) %>
---
SELECT "product_kinds".* FROM "product_kinds"

      <% @product.user_id = current_user.id %>
      <%= collection_select(:product, :user_id, User.all, :id, :name, {:include_blank => true}, {:class => 'form-control'})  %>
---
SELECT "users".* FROM "users"